[
  {
    "id": 1,
    "name": "Modern Velvet Sofa",
    "category": "Furniture",
    "price": 520,
    "material": "Velvet, Wood",
    "dimensions": "84 x 35 x 33 in",
    "stock": true,
    "image": "https://i.ibb.co.com/tM7pbxwx/Modern-Velvet-Sofa.jpg",
    "description": "A luxurious modern velvet sofa designed to bring both elegance and comfort into your living space. Upholstered with premium velvet fabric and supported by a solid wooden frame, it offers plush cushioning that invites relaxation after a long day. Its sleek design makes it perfect for contemporary apartments, studios, or even classic interiors seeking a stylish focal point. Durable, soft to the touch, and visually captivating — this sofa perfectly balances aesthetics and everyday usability.",
    "quantity": 1
  },
  {
    "id": 2,
    "name": "Wooden Coffee Table",
    "category": "Furniture",
    "price": 230,
    "material": "Oak Wood",
    "dimensions": "40 x 22 x 18 in",
    "stock": true,
    "image": "https://i.ibb.co.com/B29xwj5b/Wooden-Coffee-Table.jpg",
    "description": "Crafted from solid oak wood, this coffee table is the perfect blend of rustic charm and modern simplicity. The smooth polished surface ensures durability and a rich, natural grain that elevates any living room aesthetic. Its rounded edges make it safe for family homes while maintaining a stylish and minimal appearance. Ideal for placing books, décor, or your morning cup of coffee, this timeless piece effortlessly complements both cozy and contemporary interiors.",
    "quantity": 1
  },
  {
    "id": 3,
    "name": "Minimalist Floor Lamp",
    "category": "Lighting",
    "price": 120,
    "material": "Metal, Fabric",
    "dimensions": "60 x 12 x 12 in",
    "stock": true,
    "image": "https://i.ibb.co.com/cS6tVW1v/Minimalist-Floor-Lamp.jpg",
    "description": "This minimalist floor lamp combines functionality with aesthetic refinement. Its slim metal frame and soft fabric shade distribute a warm, calming glow that enhances the ambiance of any room. Whether used in a bedroom, study, or cozy reading nook, this lamp complements a variety of décor styles. Designed to be lightweight yet sturdy, it’s easy to move and position where needed, making it a versatile lighting choice for modern living spaces.",
    "quantity": 1
  },
  {
    "id": 4,
    "name": "Industrial Pendant Light",
    "category": "Lighting",
    "price": 180,
    "material": "Iron",
    "dimensions": "15 x 15 x 12 in",
    "stock": true,
    "image": "https://i.ibb.co.com/mFzfzj8x/Industrial-Pendant-Light.jpg",
    "description": "This industrial pendant light embodies the essence of rustic design and urban charm. Built from high-quality iron, it exudes a vintage aesthetic that fits perfectly over kitchen islands, dining areas, or cafés. The matte finish and warm glow create an inviting atmosphere, while the durable construction ensures years of reliable use. A must-have for those who appreciate the timeless appeal of industrial décor with a modern twist.",
    "quantity": 1
  },
  {
    "id": 5,
    "name": "Abstract Wall-Art Canvas",
    "category": "Wall-Art",
    "price": 95,
    "material": "Canvas, Acrylic",
    "dimensions": "30 x 40 in",
    "stock": true,
    "image": "https://i.ibb.co.com/whmfKyvZ/Abstract-Wall-Art-Canvas.jpg",
    "description": "This hand-painted abstract wall art is a perfect balance of color, motion, and creativity. Crafted on high-quality canvas with acrylic paints, it brings life and depth to plain walls. Its vibrant patterns spark curiosity and emotion, making it an ideal centerpiece for living rooms, offices, or art-inspired interiors. Every brushstroke tells a story, creating a one-of-a-kind artwork that transforms any space into a gallery of modern expression.",
    "quantity": 1
  },
  {
    "id": 6,
    "name": "Nature Landscape Frame",
    "category": "Wall-Art",
    "price": 85,
    "material": "Canvas, Wooden Frame",
    "dimensions": "28 x 36 in",
    "stock": false,
    "image": "https://i.ibb.co.com/bMFCPWW4/Nature-Landscape-Frame.jpg",
    "description": "Capture the calm essence of nature with this stunning landscape frame. Featuring a high-quality print on premium canvas, it depicts lush greenery and peaceful horizons that invite serenity into your home. The elegant wooden frame adds warmth and character, making it perfect for bedrooms, hallways, or meditation spaces. Designed for those who appreciate natural beauty and peaceful décor, this piece instantly refreshes your interior mood.",
    "quantity": 1
  },
  {
    "id": 7,
    "name": "Wool Area Rug",
    "category": "Rugs",
    "price": 260,
    "material": "100% Wool",
    "dimensions": "8 x 10 ft",
    "stock": true,
    "image": "https://i.ibb.co.com/DDzxZdW0/Wool-Area-Rug.jpg",
    "description": "This handwoven wool area rug brings warmth, comfort, and sophistication to your home. Made from 100% pure wool, its soft yet durable texture makes it ideal for living rooms or bedrooms. The geometric patterns add a modern touch, while the natural fibers offer insulation and longevity. Whether you’re going for cozy vibes or minimalist aesthetics, this rug serves as the perfect foundation for your interior design.",
    "quantity": 1
  },
  {
    "id": 8,
    "name": "Round Cotton Rug",
    "category": "Rugs",
    "price": 150,
    "material": "Cotton",
    "dimensions": "6 ft diameter",
    "stock": true,
    "image": "https://i.ibb.co.com/Fkx0y6hq/Round-Cotton-Rug.jpg",
    "description": "Soft, breathable, and stylish — this round cotton rug brings a comforting touch to any space. Handwoven with care, its subtle texture and minimalist pattern blend seamlessly with boho or Scandinavian interiors. Perfect for small corners, reading nooks, or nurseries, it’s both cozy and practical. Easy to clean and maintain, this rug adds warmth without overwhelming the room’s aesthetic.",
    "quantity": 1
  },
  {
    "id": 9,
    "name": "Classic Armchair",
    "category": "Furniture",
    "price": 320,
    "material": "Leather, Wood",
    "dimensions": "36 x 34 x 38 in",
    "stock": true,
    "image": "https://i.ibb.co.com/LDSXGkMN/Classic-Armchair.jpg",
    "description": "A true classic, this leather armchair combines timeless design with exceptional comfort. The smooth leather upholstery and solid wooden frame ensure both luxury and durability. Its ergonomic shape provides excellent support, making it a favorite reading or relaxation spot. The chair’s vintage aesthetic complements both modern and traditional interiors, making it a versatile and elegant addition to any room.",
    "quantity": 1
  },
  {
    "id": 10,
    "name": "Wall Mirror with Frame",
    "category": "Wall-Art",
    "price": 110,
    "material": "Glass, Metal Frame",
    "dimensions": "24 x 36 in",
    "stock": true,
    "image": "https://i.ibb.co.com/yBZ11W7x/Wall-Mirror-with-Frame.jpg",
    "description": "Add brightness and depth to your interiors with this stylish wall mirror. Encased in a sturdy metal frame, it reflects natural light beautifully and makes smaller spaces appear larger. Its sleek minimalist design complements contemporary, industrial, or modern décor themes. Whether in your hallway, bedroom, or living area, this mirror acts as both a functional and decorative statement piece.",
    "quantity": 1
  },
  {
    "id": 11,
    "name": "Bamboo Pendant Lamp",
    "category": "Lighting",
    "price": 160,
    "material": "Bamboo",
    "dimensions": "14 x 14 x 10 in",
    "stock": true,
    "image": "https://i.ibb.co.com/8ts06FR/Bamboo-Pendant-Lamp.jpg",
    "description": "This eco-friendly bamboo pendant lamp exudes natural warmth and organic charm. Handcrafted from sustainable bamboo, it casts a soft, diffused glow that enhances cozy dining areas or reading corners. The woven structure allows light to play through intricate patterns, creating a relaxing ambiance. Perfect for homes with boho, coastal, or minimalist décor, this lamp combines sustainability with timeless beauty.",
    "quantity": 1
  },
  {
    "id": 12,
    "name": "Modern Bookshelf",
    "category": "Furniture",
    "price": 410,
    "material": "Engineered Wood",
    "dimensions": "70 x 28 x 12 in",
    "stock": true,
    "image": "https://i.ibb.co.com/0ycx275M/Modern-Bookshelf.jpg",
    "description": "This tall modern bookshelf is both practical and visually appealing. With five adjustable shelves, it provides ample space for books, plants, and décor items. Built from sturdy engineered wood, it’s designed to withstand daily use while maintaining a sleek finish. Its minimalist lines make it a great fit for home offices or living spaces that value both organization and style.",
    "quantity": 1
  },
  {
    "id": 13,
    "name": "Handcrafted Wall Hanging",
    "category": "Wall-Art",
    "price": 75,
    "material": "Cotton Rope",
    "dimensions": "28 x 40 in",
    "stock": true,
    "image": "https://i.ibb.co.com/Q70mQK9S/Handcrafted-Wall-Hanging.jpg",
    "description": "Infuse your walls with a touch of artistry using this handcrafted cotton wall hanging. Made with intricate knotting techniques, it adds warmth, texture, and bohemian flair to any room. Perfect for bedrooms, living areas, or creative studios, it enhances blank walls with a cozy, handmade vibe. Each piece is unique, reflecting the care and craftsmanship that goes into every detail.",
    "quantity": 1
  },
  {
    "id": 14,
    "name": "Persian Pattern Rug",
    "category": "Rugs",
    "price": 320,
    "material": "Silk Blend",
    "dimensions": "9 x 12 ft",
    "stock": true,
    "image": "https://i.ibb.co.com/8LD3HbNH/Persian-Pattern-Rug.jpg",
    "description": "Step into timeless luxury with this Persian-pattern silk blend rug. Every intricate design and subtle color transition reflects heritage craftsmanship. The soft texture feels rich underfoot, while the durable weave ensures long-lasting beauty. Ideal for large living rooms or master suites, it instantly elevates your décor with an aura of elegance and sophistication.",
    "quantity": 1
  },
  {
    "id": 15,
    "name": "Tripod Standing Lamp",
    "category": "Lighting",
    "price": 210,
    "material": "Wood, Linen Shade",
    "dimensions": "58 x 16 x 16 in",
    "stock": true,
    "image": "https://i.ibb.co.com/p74Hdyv/Tripod-Standing-Lamp.jpg",
    "description": "A blend of modern design and natural materials, this tripod standing lamp brings elegance to your space. Its sturdy wooden legs provide balance and stability, while the linen shade emits a soft, ambient light perfect for reading or relaxing. Ideal for living rooms and studios, it serves as both a décor element and a functional lighting solution for cozy evenings.",
    "quantity": 1
  },
  {
    "id": 16,
    "name": "Marble Top Table",
    "category": "Furniture",
    "price": 270,
    "material": "Marble, Iron Base",
    "dimensions": "24 x 24 x 20 in",
    "stock": true,
    "image": "https://i.ibb.co.com/hxYFvcLt/Marble-Top-Table.jpg",
    "description": "This marble-top table redefines luxury with its sleek and sturdy design. The polished marble surface adds a touch of sophistication, while the iron base with gold finish ensures durability and stability. Ideal as a side or accent table, it effortlessly complements modern and classic interiors. Perfect for displaying décor, plants, or simply your morning coffee in style.",
    "quantity": 1
  }
]
